In [34]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [84]:
male_data=pd.read_csv(r"C:\Users\PIYUSH\Desktop\gender_male\m_names.csv")

In [85]:
male_data.describe()

          name gender    race
count    14821  14845   14845
unique    8519      1       1
top     deepak      m  indian
freq       135  14845   14845

In [86]:
male_data.dropna(subset=["name"],inplace=True)

In [87]:
male_data.describe()

          name gender    race
count    14821  14821   14821
unique    8519      1       1
top     deepak      m  indian
freq       135  14821   14821

In [88]:
male_data.shape

(14821, 3)

In [89]:
male_data.drop_duplicates(subset=["name"],keep=False,inplace=True)

In [90]:
male_data.describe()

                     name gender    race
count                7159   7159    7159
unique               7159      1       1
top     madhusudan prasad      m  indian
freq                    1   7159    7159

In [91]:
f_data=pd.read_csv(r"C:\Users\PIYUSH\Desktop\gender_female\f_names.csv")

In [92]:
f_data.shape

(15382, 3)

In [93]:
f_data.describe()

         name gender    race
count   15351  15382   15382
unique   6773      1       1
top     pooja      f  indian
freq      346  15382   15382

In [94]:
f_data.isnull().sum()

name      31
gender     0
race       0
dtype: int64

In [95]:
f_data.dropna(subset=["name"],inplace=True)

In [96]:
f_data.drop_duplicates(subset=["name"],keep=False,inplace=True)

In [97]:
f_data.shape

(5578, 3)